step4_test/resources/requests/GetWeatherInformationTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://www.codecentric.de/namespace/weatherservice/general">
   <soapenv:Header/>
   <soapenv:Body>
      <gen:GetWeatherInformation>
      	<gen:ZIP>99425</gen:ZIP>
      </gen:GetWeatherInformation>
   </soapenv:Body>
</soapenv:Envelope>